Repository: 84000/data-translation-memory
Catalog: toh584-v4.tmx
Source language: bo
Languages: en

source: ༄༅། །དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Three Jewels.

source: ཨོཾ་ནྠཱཾ་ན་མཿསརྦ་བུད་དྷཱ་ནཱཾ། ཨོཾ་མཱཾ། བྷྲཱུཾ་མཱུཾ། ཏདྱ་ཐཱ། ཨོཾ་བྲཱུཾ།
en: oṃ nthiṃ | nāmaḥ sarvabuddhānām | oṃ māṃ bhrūṃ mūṃ | tadyathā | oṃ bhrūm |

source: འདི་བཟུང་བས་འཕགས་པ་ཕལ་པོ་ཆེ་གཟུང་བར་འགྱུར་རོ། །
en: By taking up this dhāraṇī, one will retain the noble Avataṃsaka.

source: འདྲི་བ་དང་། ཀློག་པ་ཡང་དེ་དང་འདྲའོ། །
en: One will be like someone who has written it and recited it.

source: འཕགས་པ་ཕལ་པོ་ཆེ་གཟུང་བར་འགྱུར་བའི་གཟུངས་རྫོགས་སོ།། །།
en: This completes “The Dhāraṇī for Retaining the Noble Avataṃsaka.”
